{
    "title": "Can the photosynthesis first step quantum mechanism be explained?",
    "authors": [
        "Marco Sacilotti",
        "Euclides Almeida",
        "Claudia C. B. O. Mota",
        "Frederico Dias Nunes",
        "Anderson S. L. Gomes"
    ],
    "summary": "Photosynthesis first step mechanism concerns the sunlight absorption and both negative and positive charges separation. Recent and important photosynthesis literature claims that this mechanism is quantum mechanics controlled, however without presenting qualitative or quantitative scientifically based mechanism. The present accepted and old-fashioned photosynthesis mechanism model suffers from few drawbacks and an important issue is the absence of driving force for negative and positive charges separation. This article presents a new qualitative model for this first step mechanism in natural catalytic systems such as photosynthesis in green leaves. The model uses a concept of semiconductor band gap engineering, such as the staggered energy band gap line-up in semiconductors. To explain the primary mechanism in natural photosynthesis the proposal is the following: incident light is absorbed inside the leaves causing charges separation. The only energetic configuration that allows charges separation under illumination is the staggered one between two materials or molecules. We explain why (e-, h+) interacting charges can be separated by using an energy staggered configuration, under illumination. Following this model, the green light of plants can be seen as related to the spent energy for charges separation. Green colour being mostly an emission and not a reflection as currently presented. The arguments mentioned below show why we cannot explain the photosynthesis first step mechanism, based on the presently accepted model, and therefore the alternative model is presented.",
    "published": "2010-05-08T15:03:14Z",
    "pdf_url": "https://arxiv.org/pdf/1005.1337v1",
    "arxiv_id": "1005.1337v1",
    "link": "https://arxiv.org/abs/1005.1337v1",
    "categories": "physics.chem-ph",
    "local_pdf": "./data\\papers\\Can_the_photosynthesis_first_step_quantum_mechanism_be_explained.pdf"
}