{
    "title": "The Galactic Chemical Evolution of phosphorus observed with IGRINS",
    "authors": [
        "G. Nandakumar",
        "N. Ryde",
        "M. Montelius",
        "B. Thorsbro",
        "H. Jönsson",
        "G. Mace",
        "Lund Observatory",
        "Department of Astronomy",
        "Theoretical Physics",
        "Lund University",
        "Box 43",
        "SE-221 00 Lund",
        "Sweden",
        "Kapteyn Astronomical Institute",
        "University of Groningen",
        "Landleven 12",
        "NL-9747 AD Groningen",
        "the Netherlands",
        "Department of Astronomy",
        "School of Science",
        "The University of Tokyo",
        "7-3-1 Hongo",
        "Bunkyo-ku",
        "Tokyo 113-0033",
        "Japan",
        "Materials Science",
        "Applied Mathematics",
        "Malmö University",
        "SE-205 06 Malmö",
        "Sweden",
        "Department of Astronomy",
        "McDonald Observatory",
        "The University of Texas",
        "Austin",
        "TX 78712",
        "USA"
    ],
    "summary": "Phosphorus (P) is considered to be one of the key elements for life, making it an important element to look for in the abundance analysis of spectra of stellar systems. Yet, there exists only a handful of spectroscopic studies to estimate the P abundances and investigate its trend across a range of metallicities. We have observed full HK band spectra at a spectral resolving power of R=45,000 with IGRINS instrument. Abundances are determined using SME in combination with 1D MARCS stellar atmosphere models. The investigated sample of stars have reliable stellar parameters estimated using optical FIES spectra (GILD; Jönsson et al. in prep.). In order to determine the P abundances from the 16482.92 Angstrom P line, we take special care of the CO($ν=7-4$) blend. We determine the C, N, O abundances from atomic carbon and a range of non-blended molecular lines (CO, CN, OH) which are aplenty in the H band region of K giant stars, assuring an appropriate modelling of the blending CO($ν=7-4$) line. We present [P/Fe] vs [Fe/H] trend for 38 K giant stars in the metallicity range of -1.2 dex $<$ [Fe/H] $<$ 0.4 dex. We find that our trend matches well with the compiled literature sample of prominently dwarf stars and limited number of giant stars. Our trend is found to be higher by $\\sim$ 0.05 - 0.1 dex compared to the theoretical chemical evolution trend in Cescutti et al. 2012 resulting from core collapse supernova (type II) of massive stars with the P yields from Kobayashi et al. (2006) arbitrarily increased by a factor of 2.75. Thus the enhancement factor might need to be $\\sim$ 0.05 - 0.1 dex higher to match our trend. We also find an empirically determined primary behaviour for phosphorus. Furthermore, the phosphorus abundance is found to be elevated by $\\sim$ 0.6 - 0.9 dex in two metal poor s-enriched stars compared to the theoretical chemical evolution trend.",
    "published": "2022-10-10T18:16:50Z",
    "pdf_url": "https://arxiv.org/pdf/2210.04940v1",
    "arxiv_id": "2210.04940v1",
    "link": "https://arxiv.org/abs/2210.04940v1",
    "categories": "astro-ph.SR",
    "local_pdf": "./data\\papers\\The_Galactic_Chemical_Evolution_of_phosphorus_observed_with_IGRINS.pdf"
}